/**
  * https://github.com/Cboyce-CJ/CJPCD
  * 
  * plugin name : 省市区生成插件
  * author : Cboyce
  * date : 2016-10-17
  * version : 1.0.1
  ************************使用步骤(3步)**********************
  * 1.提供三个select并设置不同的Id
  * 2.引入cj-pcd-1.0.1.js
  * 3.调用方法
  	如下:
  	1)初始化:(province:省份, city:城市, city 回调函数) 		  
      var pcd = new CJPCD("province", "city", "city_click()");
 		2)设置自定义值
 			1.在初始化的前提下调用
 			pcd.setUp(province,city);
		3)重置
			pcd.reSet
 	    4)获取值
            var value = pcd.getValue();
            "广东省广州市越秀区"
              
            var value = pcd.getValue(',');
            "广东省,广州市,越秀区"
            
     	  	var value = pcd.getValue("json");
     	  	{"province":province_val,"city":city_val}
      
		更多请关注作者 Cboyce
 	************************使用方法**********************
*/
;
//json 数据源

(function() {
    'use strict';

    var CJPCD = function(provinceId, cityId, city_click) {
        if (!(this instanceof CJPCD)) return new CJPCD(provinceId, cityId);

        var c = this;

        //初始化
        c.province = document.getElementById(provinceId);
        c.city = document.getElementById(cityId);

        //创建省市区数据
        c.builder_init = function() {
            //初始化先创建省份数据
            c.province_builder();

            c.bindChangeEvent();

            //初始化触发
            c.province.onchange();
        };

        //设置自定义值
        c.set_value = function(province, city) {
            //创建省数据
            c.province_builder();
            c.province.value = province;

            //创建市数据
            c.city_builder();
            c.city.value = city;

            //绑定事件
            c.bindChangeEvent();
        };

        //绑定事件
        c.bindChangeEvent = function() {
            c.province.onchange = function() {
                c.city_builder();
            };
        };

        //生成省数据
        c.province_builder = function() {
            c.province.innerHTML = "";
            //创建子元素
            c.optionFactory(c.cj_areas_json, c.province, "prov_index");
        };

        //生成市数据
        c.city_builder = function() {
            c.city.innerHTML = "";
            //获取当前选中省份的索引
            if (c.province.options[c.province.selectedIndex]) {
                var pro_Id = c.province.options[c.province.selectedIndex].getAttribute("prov_index");
            } else {
                var pro_Id = 0;
            }

            var city_obj = c.cj_areas_json[pro_Id].city;
            //创建子元素
            c.optionFactory(city_obj, c.city, "city_index");
        };

        //通用创建子函数方法
        c.optionFactory = function(json_data, parent_obj, attr_name) {
            /*
        数据源没有 "省","市"(节省空间)
        我们需要自己加(排除四个直辖市)
        区,县没有规律可循,所以数据源是完整的
      */
            var option;
            for (var i = 0; i < json_data.length; i++) {
                var name = !json_data[i].name ? json_data[i] : json_data[i].name;
                option = document.createElement("option");
                if (attr_name)
                    option.setAttribute(attr_name, i);
                    
                if (attr_name == "city_index")
                    option.setAttribute("onclick", city_click);

                //加上后缀之前要排除直辖市和自治区
                option.innerHTML = name;
                parent_obj.appendChild(option);
            };
            option = null;
        };

        c.get_value = function(valueType) {
            var province_val = c.province.options[c.province.selectedIndex].value;
            var city_val = c.city.options[c.city.selectedIndex].value;

            if (valueType == "json")
                return {
                    "province": province_val,
                    "city": city_val
            };
            else
                return province_val + city_val;
        };

        //内部初始化
        c.builder_init();

        //提供API给外部使用
        return {
            setUp: c.set_value, //设置值
            reSet: c.builder_init, //重置
            getValue: c.get_value //获取值
        };
    };

    //属性
    CJPCD.prototype = {
        // 2020年全国统计用区划代码和城乡划分代码(截至2020年6月30日)(国家统计局2020-11-06发布)
        cj_areas_json: [{
                "name": "北京市",
                "city": ["东城区", "西城区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云区", "延庆区"]
            }, {
                "name": "天津市",
                "city": ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "滨海新区", "宁河区", "静海区", "蓟州区"]
            }, {
                "name": "上海市",
                "city": ["黄浦区", "徐汇区", "长宁区", "静安区", "普陀区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "奉贤区", "崇明区"]
            }, {
                "name": "重庆市",
                "city": ["万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "綦江区", "大足区", "渝北区", "巴南区", "黔江区", "长寿区", "江津区", "合川区", "永川区", "南川区", "璧山区", "铜梁区", "潼南区", "荣昌区", "开州区", "梁平区", "武隆区", "城口县", "丰都县", "垫江县", "忠县", "云阳县", "奉节县", "巫山县", "巫溪县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县"]
            }, {
                "name": "河北省",
                "city": ["石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市", "衡水市"]
            }, {
                "name": "山西省",
                "city": ["太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市"]
            }, {
                "name": "内蒙古自治区",
                "city": ["呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "兴安盟", "锡林郭勒盟", "阿拉善盟"]
            }, {
                "name": "辽宁省",
                "city": ["沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市"]
            }, {
                "name": "吉林省",
                "city": ["长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市", "白城市", "延边朝鲜族自治州"]
            }, {
                "name": "黑龙江省",
                "city": ["哈尔滨市", "齐齐哈尔市", "鸡西市", "鹤岗市", "双鸭山市", "大庆市", "伊春市", "佳木斯市", "七台河市", "牡丹江市", "黑河市", "绥化市", "大兴安岭地区"]
            }, {
                "name": "江苏省",
                "city": ["南京市", "无锡市", "徐州市", "常州市", "苏州市", "南通市", "连云港市", "淮安市", "盐城市", "扬州市", "镇江市", "泰州市", "宿迁市"]
            }, {
                "name": "浙江省",
                "city": ["杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市", "衢州市", "舟山市", "台州市", "丽水市"]
            }, {
                "name": "安徽省",
                "city": ["合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市", "安庆市", "黄山市", "滁州市", "阜阳市", "宿州市", "六安市", "亳州市", "池州市", "宣城市"]
            }, {
                "name": "福建省",
                "city": ["福州市", "厦门市", "莆田市", "三明市", "泉州市", "漳州市", "南平市", "龙岩市", "宁德市"]
            }, {
                "name": "江西省",
                "city": ["南昌市", "景德镇市", "萍乡市", "九江市", "新余市", "鹰潭市", "赣州市", "吉安市", "宜春市", "抚州市", "上饶市"]
            }, {
                "name": "山东省",
                "city": ["济南市", "青岛市", "淄博市", "枣庄市", "东营市", "烟台市", "潍坊市", "济宁市", "泰安市", "威海市", "日照市", "临沂市", "德州市", "聊城市", "滨州市", "菏泽市"]
            }, {
                "name": "河南省",
                "city": ["郑州市", "开封市", "洛阳市", "平顶山市", "安阳市", "鹤壁市", "新乡市", "焦作市", "濮阳市", "许昌市", "漯河市", "三门峡市", "南阳市", "商丘市", "信阳市", "周口市", "驻马店市", "济源市"]
            }, {
                "name": "湖北省",
                "city": ["武汉市", "黄石市", "十堰市", "宜昌市", "襄阳市", "鄂州市", "荆门市", "孝感市", "荆州市", "黄冈市", "咸宁市", "随州市", "恩施土家族苗族自治州", "仙桃市", "潜江市", "天门市", "神农架林区"]
            }, {
                "name": "湖南省",
                "city": ["长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市", "岳阳市", "常德市", "张家界市", "益阳市", "郴州市", "永州市", "怀化市", "娄底市", "湘西土家族苗族自治州"]
            }, {
                "name": "广东省",
                "city": ["广州市", "韶关市", "深圳市", "珠海市", "汕头市", "佛山市", "江门市", "湛江市", "茂名市", "肇庆市", "惠州市", "梅州市", "汕尾市", "河源市", "阳江市", "清远市", "东莞市", "中山市", "潮州市", "揭阳市", "云浮市"]
            }, {
                "name": "广西壮族自治区",
                "city": ["南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市"]
            }, {
                "name": "海南省",
                "city": ["海口市", "三亚市", "三沙市", "儋州市", "五指山市", "琼海市", "文昌市", "万宁市", "东方市", "定安县", "屯昌县", "澄迈县", "临高县", "白沙黎族自治县", "昌江黎族自治县", "乐东黎族自治县", "陵水黎族自治县"]
            }, {
                "name": "四川省",
                "city": ["成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市", "雅安市", "巴中市", "资阳市", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州"]
            }, {
                "name": "贵州省",
                "city": ["贵阳市", "六盘水市", "遵义市", "安顺市", "毕节市", "铜仁市", "黔西南布依族苗族自治州", "黔东南苗族侗族自治州", "黔南布依族苗族自治州"]
            }, {
                "name": "云南省",
                "city": ["昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "普洱市", "临沧市", "楚雄彝族自治州", "红河哈尼族彝族自治州", "文山壮族苗族自治州", "西双版纳傣族自治州", "大理白族自治州", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州"]
            }, {
                "name": "西藏自治区",
                "city": ["拉萨市", "日喀则市", "昌都市", "林芝市", "山南市", "那曲市", "阿里地区"]
            }, {
                "name": "陕西省",
                "city": ["西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "延安市", "汉中市", "榆林市", "安康市", "商洛市"]
            }, {
                "name": "甘肃省",
                "city": ["兰州市", "嘉峪关市", "金昌市", "白银市", "天水市", "武威市", "张掖市", "平凉市", "酒泉市", "庆阳市", "定西市", "陇南市", "临夏回族自治州", "甘南藏族自治州"]
            }, {
                "name": "青海省",
                "city": ["西宁市", "海东市", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州"]
            }, {
                "name": "宁夏回族自治区",
                "city": ["银川市", "石嘴山市", "吴忠市", "固原市", "中卫市"]
            }, {
                "name": "新疆维吾尔自治区",
                "city": ["乌鲁木齐市", "克拉玛依市", "吐鲁番市", "哈密市", "昌吉回族自治州", "博尔塔拉蒙古自治州", "巴音郭楞蒙古自治州", "阿克苏地区", "克孜勒苏柯尔克孜自治州", "喀什地区", "和田地区", "伊犁哈萨克自治州", "塔城地区", "阿勒泰地区", "石河子市", "阿拉尔市", "图木舒克市", "五家渠市", "北屯市", "铁门关市", "双河市", "可克达拉市", "昆玉市", "胡杨河市"]
            }, {
                "name": "台湾省",
                "city": ["台北市", "高雄市", "台北县", "桃园县", "新竹县", "苗栗县", "台中县", "彰化县", "南投县", "云林县", "嘉义县", "台南县", "高雄县", "屏东县", "宜兰县", "花莲县", "台东县", "澎湖县", "基隆市", "新竹市", "台中市", "嘉义市", "台南市"]
            }, {
                "name": "澳门特别行政区",
                "city": ["花地玛堂区", "圣安多尼堂区", "大堂区", "望德堂区", "风顺堂区", "嘉模堂区", "圣方济各堂区", "路凼"]
            }, {
                "name": "香港特别行政区",
                "city": ["中西区", "湾仔区", "东区", "南区", "深水埗区", "油尖旺区", "九龙城区", "黄大仙区", "观塘区", "北区", "大埔区", "沙田区", "西贡区", "元朗区", "屯门区", "荃湾区", "葵青区", "离岛区"]
            }
        ],
    };

    window.CJPCD = CJPCD;

}());
